# `FRE 521D_Assignment 1_Group 3`

## Task 1

The database consists of five tables:

1. countries
2. crop
2. country_name_mapping
3. crop_production
4. temperature_anomalies

Each table is designed to represent a distinct entity and maintain referential integrity across datasets.

a)
1. The *countries* table stores standardized country-level attributes that are shared across both datasets.
- Avoid duplication of country metadata such as region and income group
- Provide a single authoritative reference for country identifiers
- Enable consistent joins across agricultural and climate datasets

Key fields include: 
country_id (Primary Key); country_name; iso3_code; region; income_group

2. The *crops* table stores standardized crop-level attributes that are reused across agricultural production records.

- Avoid duplication of crop names across production rows
- Prevent inconsistencies caused by spelling variations or formatting differences (e.g., "Wheat" vs "Wheat " )
- Provide a single authoritative reference for crop identifiers used in agricultural analysis

Key fields include: 
crop_id (Primary Key); crop_name

3. [e)] The *country_name_mapping* table resolves inconsistencies in country naming across the two source datasets.

- Map multiple source-specific country name variants to a standardized country identifier
- Enable reliable joins between crop production and temperature anomaly datasets
- Explicitly document data harmonization decisions across data sources

Key fields include:
source_country_name (Primary Key); country_id (Foreign Key from countries.country_id)

4. The *crop_production* table stores annual agricultural production measures at the country–year–crop level and serves as the core fact table for analysis.

- Store time-varying agricultural metrics derived from the crop production dataset
- Support analysis of production, yield, and agricultural inputs over time
- Enable aggregation and comparison across countries, regions, crops, and years

Key fields include:
country_id (from countries.country_id); year; crop_id (from crops.crop_id); area_harvested_ha; production_tonnes; yield_kg_ha; fertilizer_use_kg_ha; irrigation_pct; notes; where (country_id, year, crop_id) is the Primary Key

5. The *temperature_anomalies* table stores annual temperature anomaly measures at the country–year level and serves as the climate fact table.

- Store time-varying climate metrics derived from the temperature anomaly dataset
- Support integration of climate indicators with agricultural production data
- Enable comparison of agricultural outcomes across warmer and cooler years

Key fields include:
country_id (Foreign Key from countries.country_id); year; annual_anomaly_c; jan–dec.

b)

`Primary Keys`

The *countries table* uses *country_id* as its primary key, serving as the unique identifier for each country.

The *crops table* uses *crop_id* as its primary key, ensuring the identifier for each crop.

The *country_name_mapping* table uses *source_country_name* as its primary key, guaranteeing that each raw country name from the source datasets maps to a single standardized country.

The *crop_production* table uses a composite primary key *(country_id, year, crop_id)*, reflecting the natural grain of the data, where each record represents a unique country–year–crop observation.

The *temperature_anomalies* table uses a composite primary key *(country_id, year)*, consistent with the country–year granularity of the temperature dataset.

`Foreign Keys`

*crop_production.country_id* references *countries.country_id*, bringing agricultural observations and country together.

*crop_production.crop_id* references *crops.crop_id*, enabling consistency in crop identification.

*temperature_anomalies.country_id* references *countries.country_id*, enabling all climate records to be associated with valid countries.

*country_name_mapping.country_id* references *countries.country_id*, enabling source-specific country names with standardized identifiers.

c)

*countries* table:
- country_id: INT, numeric surrogate key that enables efficient joins and indexing
- country_name: VARCHAR, flexible text storage for country names of varying length
- iso3_code: CHAR(3), fixed-length ISO country code of 3
- region: VARCHAR, categorical attribute representing geographic region
- income_group: VARCHAR, categorical attribute representing income classification


*crops* table:
- crop_id: INT, numeric surrogate key for standardized crop identification
- crop_name: VARCHAR, categorical text field storing unique crop names


*country_name_mapping* table:
- source_dataset: VARCHAR, indicates which source dataset the raw country name came from (e.g., 'crop', 'temp'), so the same string can be mapped differently across sources if needed
- source_country_name: VARCHAR, stores raw country name strings exactly as they appear in source datasets
- country_id: INT, foreign referencing countries.country_id, linking each source-specific country name to standardized country identifiers


*crop_production* table:
- country_id: INT, foreign key enabling joins with standardized country metadata
- year: INT, numeric representation supporting temporal filtering and grouping
- crop_id: INT, foreign key enforcing consistent crop identification
- area_harvested_ha: FLOAT, continuous numeric measure of harvested area
- production_tonnes: FLOAT, continuous numeric measure of total production
- yield_kg_ha: FLOAT, continuous numeric yield metric
- fertilizer_use_kg_ha: FLOAT, continuous numeric input measure
- irrigation_pct: FLOAT, numeric percentage representing irrigation coverage
- notes: VARCHAR, free-text field for annotations and metadata


*temperature_anomalies* table:
- country_id: INT, foreign key enabling integration with agricultural data
- year: INT, numeric representation of the observation year
- annual_anomaly_c: FLOAT, continuous numeric climate anomaly measure
- jan–dec: FLOAT (nullable), monthly temperature anomaly values that may be missing

d) 

The schema is normalized mainly to reduce data repetition and keep country and crop identifiers consistent across datasets. Country-level information such as region, income group, and ISO code is stored in a separate countries table instead of being repeated in every agricultural or climate record. Crop names are also placed in a crops table so that the same crop is always identified in a consistent way. Agricultural production data and temperature anomaly data are stored in different fact tables because they have different data structures and time coverage. Differences in country names between the source files are handled using a country_name_mapping table, which helps connect the datasets correctly. Composite keys are used in the fact tables to match the natural structure of the data and uniquely identify each observation.

In [1]:
# Import required libraries
import pandas as pd
import numpy as np
from sqlalchemy import create_engine, text
import warnings

warnings.filterwarnings("ignore")

In [2]:
# Load the SQL magic extension
%load_ext sql
    
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%config SqlMagic.autopandas = False

In [3]:
%load_ext sql
%sql mysql+pymysql://mfre521d_user:mfre521d_user_pw@127.0.0.1:3306/mfre521d

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [4]:
# Database connection parameters
DB_USER = "mfre521d_user"
DB_PASSWORD = "mfre521d_user_pw"
DB_HOST = "localhost"
DB_PORT = "3306"
DB_NAME = "mfre521d"

# Create connection string
connection_string = f"mysql+pymysql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}"

# Create SQLAlchemy engine
engine = create_engine(connection_string)

# Connect using SQL magic
%sql {connection_string}

In [5]:
%%sql

SELECT 'Connection successful!' AS status, NOW() AS current_ts;

   mysql+pymysql://mfre521d_user:***@127.0.0.1:3306/mfre521d
 * mysql+pymysql://mfre521d_user:***@localhost:3306/mfre521d
1 rows affected.

[('Connection successful!', datetime.datetime(2026, 1, 15, 9, 39, 18))]

Import CSV Files - 1) Crop Production, and 2) Temperature Anomalies

In [6]:
from pathlib import Path
import pandas as pd

# Locate repo root
# Notebook is in: 521d_assignment/notebooks/
# Repo root is:   521d_assignment/
repo_root = Path.cwd().resolve().parents[0]

print("Repo root:", repo_root)

# Build paths to CSV files
crop_csv = repo_root / "data" / "crop_production_1990_2023.csv"
temp_csv = repo_root / "data" / "temperature_anomalies_1990_2023.csv"

print("Crop CSV exists:", crop_csv.exists())
print("Temp CSV exists:", temp_csv.exists())

Repo root: /Users/juliettemennicken/fre521d/521d_assignment
Crop CSV exists: True
Temp CSV exists: True

In [7]:
# Read crop production data
crop_df_raw = pd.read_csv(crop_csv, na_values=["..", "NA", ""], encoding="utf-8")

print("Crop data shape:", crop_df_raw.shape)
crop_df_raw.head()

Crop data shape: (4187, 12)

,Country,ISO3_Code,Region,Income_Group,Year,Crop,Area_Harvested_Ha,Production_Tonnes,Yield_Kg_Ha,Fertilizer_Use_Kg_Ha,Irrigation_Pct,Notes
0,China,CHN,East Asia,Upper middle income,2001.0,Soybeans,3751494,12036421.75,3208.43,100.9,NaN,NaN
1,Nepal,NPL,South Asia,Low income,1993.0,Maize,2112762,11377270.55,"5385,02","19,14",9.8,NaN
2,South Korea,KOR,East Asia,High income,1995.0,Soybeans,1650777,7474101.16,4527.63,193.84,56.6,NaN
3,United States,USA,North America,High income,2018.0,Wheat,4782989,32397951.41,6773.58,205.12,62.5,NaN
4,Japan,JPN,East Asia,High income,2013.0,Rice,5434696,58322509.35,"10731,51","211,64",61.4,NaN

In [8]:
# Read temperature anomaly data
temp_df_raw = pd.read_csv(temp_csv, na_values=["NA", ""], encoding="utf-8")

print("Temperature data shape:", temp_df_raw.shape)
temp_df_raw.head()

Temperature data shape: (1137, 15)

,Country_Name,Year,Annual_Anomaly_C,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
0,United States of America,1990,0.07,(0.02),NaN,NaN,-0.09,(0.11),0.44,-0.44,0.3,-0.08,(0.03),-0.31,-0.39
1,United States of America,1991,0.2,0.36,0.4,0.6,0.74,0.22,0.34,0.22,0.7,NaN,-0.44,-0.5,-0.22
2,United States of America,1992,0.54,0.46,0.76,0.85,0.68,0.6,0.98,0.52,0.92,0.53,0.01,0.09,0.07
3,United States of America,1993,0.43,0.28,0.22,0.74,0.6,NaN,1.3,0.81,0.35,(0.3),0.04,0.55,-0.13
4,United States of America,1994,0.87,0.75,0.86,0.65,1.14,0.45,1.71,1.27,1.04,0.01,0.62,1.05,0.88

## Task 2 - Creating tables & Ingesting data

### Inspecting the data

In [9]:
# checking column names & data type
crop_df_raw.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4187 entries, 0 to 4186
Data columns (total 12 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Country               4187 non-null   object
 1   ISO3_Code             4187 non-null   object
 2   Region                4187 non-null   object
 3   Income_Group          4187 non-null   object
 4   Year                  4187 non-null   float64
 5   Crop                  4187 non-null   object
 6   Area_Harvested_Ha     4187 non-null   int64
 7   Production_Tonnes     4087 non-null   object
 8   Yield_Kg_Ha           4083 non-null   object
 9   Fertilizer_Use_Kg_Ha  4090 non-null   object
 10  Irrigation_Pct        4088 non-null   object
 11  Notes                 209 non-null    object
dtypes: float64(1), int64(1), object(10)
memory usage: 392.7+ KB

In [10]:
temp_df_raw.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1137 entries, 0 to 1136
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Country_Name      1137 non-null   object
 1   Year              1137 non-null   int64
 2   Annual_Anomaly_C  1137 non-null   object
 3   Jan               1114 non-null   object
 4   Feb               1114 non-null   object
 5   Mar               1114 non-null   object
 6   Apr               1115 non-null   object
 7   May               1115 non-null   object
 8   Jun               1114 non-null   object
 9   Jul               1114 non-null   object
 10  Aug               1114 non-null   object
 11  Sep               1114 non-null   object
 12  Oct               1114 non-null   object
 13  Nov               1114 non-null   object
 14  Dec               1114 non-null   object
dtypes: int64(1), object(14)
memory usage: 133.4+ KB

### Cleaning the data

In [11]:
# converting year type for crop df & checking temp df to avoid join / key mismatches later

crop_df = crop_df_raw.copy()
crop_df["Year"] = pd.to_numeric(crop_df["Year"], errors="coerce").astype("Int64")

temp_df = temp_df_raw.copy()

assert (
    crop_df["Year"].isna().sum() == 0
)  # if no error, will run cell, otherwise will throw an error
assert temp_df["Year"].isna().sum() == 0
print("Year columns validated.")

Year columns validated.

In [12]:
# checking if parentheses in the temp_df_raw appear alongside minus signs

temp_df_raw.apply(
    lambda col: col.astype(str).str.contains(r"\(-", regex=True, na=False).any()
).sum()

# checking how many times parentheses occur in each column to see if it's noise or a systematic occurence
months = [
    "Jan",
    "Feb",
    "Mar",
    "Apr",
    "May",
    "Jun",
    "Jul",
    "Aug",
    "Sep",
    "Oct",
    "Nov",
    "Dec",
]
cols = ["Annual_Anomaly_C"] + months

for c in cols:
    n = (
        temp_df_raw[c]
        .astype("string")
        .str.contains(r"^\(.*\)$", regex=True, na=False)
        .sum()
    )
    if n:
        print(c, n)

Annual_Anomaly_C 35
Jan 55
Feb 38
Mar 34
Apr 22
May 27
Jun 40
Jul 50
Aug 51
Sep 64
Oct 81
Nov 73
Dec 83

In [13]:
# More cleaning

# 1. Cleaning crop_df

crop_numeric_cols = [
    "Area_Harvested_Ha",
    "Production_Tonnes",
    "Yield_Kg_Ha",
    "Fertilizer_Use_Kg_Ha",
    "Irrigation_Pct",
]


def clean_num_eu(series):  # series refers to one pandas column
    # forcing everything to be read as string temporarily & .str.strip() removes leading & trailing spaces e.g., " 19.14 "
    s = series.astype("string").str.strip()
    # removing anything that is not digits 0-9, commas, dots, minus signs & parentheses (e.g., footnote markers)
    s = s.str.replace(r"[^0-9,\.\(\)]", "", regex=True)
    # EU decimal conversion to dot
    s = s.str.replace(",", ".", regex=False)
    # replacing any negative values represented with parentheses to minus signs
    s = s.str.replace(r"^\((.*)\)$", r"-\1", regex=True)
    # converting any missing values (after all transformation above) to NA
    s = s.replace({"": pd.NA})
    return pd.to_numeric(s, errors="coerce")


# applying function to each column in crop_numeric_cols
for c in crop_numeric_cols:
    crop_df[c] = clean_num_eu(crop_df[c])

# 2. Cleaning temp_df

temp_numeric_cols = [
    "Annual_Anomaly_C",
    "Jan",
    "Feb",
    "Mar",
    "Apr",
    "May",
    "Jun",
    "Jul",
    "Aug",
    "Sep",
    "Oct",
    "Nov",
    "Dec",
]

for c in temp_numeric_cols:
    s = temp_df[c].astype("string").str.strip()
    s = s.str.replace(
        r"^\((.*)\)$", r"-\1", regex=True
    )  # replacing parentheses (negative values) with a minus sign
    s = s.replace({"": pd.NA})
    temp_df[c] = pd.to_numeric(s, errors="coerce")

# checking results of cleaning

print("Crop cleaned dtypes:\n", crop_df[["Year"] + crop_numeric_cols].dtypes)
print("Temperature cleaned dtypes:\n", temp_df[["Year"] + temp_numeric_cols].dtypes)

Crop cleaned dtypes:
 Year                      Int64
Area_Harvested_Ha         Int64
Production_Tonnes       Float64
Yield_Kg_Ha             Float64
Fertilizer_Use_Kg_Ha    Float64
Irrigation_Pct          Float64
dtype: object
Temperature cleaned dtypes:
 Year                  int64
Annual_Anomaly_C    Float64
Jan                 Float64
Feb                 Float64
Mar                 Float64
Apr                 Float64
May                 Float64
Jun                 Float64
Jul                 Float64
Aug                 Float64
Sep                 Float64
Oct                 Float64
Nov                 Float64
Dec                 Float64
dtype: object

In [14]:
# checking NA values

print(crop_df[crop_numeric_cols].isna().sum())
print(temp_df[temp_numeric_cols].isna().sum())

# checking duplicates
# checking that there are no duplicate crop observations for the combination 'country', 'isocode', 'year', 'crop' & 'country_name', 'year'
print(crop_df.duplicated(subset=["Country", "ISO3_Code", "Year", "Crop"]).sum())
print(temp_df.duplicated(subset=["Country_Name", "Year"]).sum())

Area_Harvested_Ha         0
Production_Tonnes       195
Yield_Kg_Ha             125
Fertilizer_Use_Kg_Ha    125
Irrigation_Pct          125
dtype: int64
Annual_Anomaly_C     0
Jan                 23
Feb                 23
Mar                 23
Apr                 22
May                 22
Jun                 23
Jul                 23
Aug                 23
Sep                 23
Oct                 23
Nov                 23
Dec                 23
dtype: int64
0
0

In [15]:
# renaming columns to be consistent going forward (all lower-case)

crop_rename = {
    "Country": "country",
    "ISO3_Code": "iso3_code",
    "Region": "region",
    "Income_Group": "income_group",
    "Year": "year",
    "Crop": "crop",
    "Area_Harvested_Ha": "area_harvested_ha",
    "Production_Tonnes": "production_tonnes",
    "Yield_Kg_Ha": "yield_kg_ha",
    "Fertilizer_Use_Kg_Ha": "fertilizer_use_kg_ha",
    "Irrigation_Pct": "irrigation_pct",
    "Notes": "notes",
}
crop_df = crop_df.rename(columns=crop_rename)

temp_rename = {
    "Country_Name": "country_name",
    "Year": "year",
    "Annual_Anomaly_C": "annual_anomaly_c",
    "Jan": "jan",
    "Feb": "feb",
    "Mar": "mar",
    "Apr": "apr",
    "May": "may",
    "Jun": "jun",
    "Jul": "jul",
    "Aug": "aug",
    "Sep": "sep",
    "Oct": "oct",
    "Nov": "nov",
    "Dec": "dec",
}
temp_df = temp_df.rename(columns=temp_rename)

In [16]:
# also renaming crop_numeric_cols & temp_numeric_cols to match new naming

crop_numeric_cols = [
    "area_harvested_ha",
    "production_tonnes",
    "yield_kg_ha",
    "fertilizer_use_kg_ha",
    "irrigation_pct",
]

temp_numeric_cols = [
    "annual_anomaly_c",
    "jan",
    "feb",
    "mar",
    "apr",
    "may",
    "jun",
    "jul",
    "aug",
    "sep",
    "oct",
    "nov",
    "dec",
]

### Loading data into MySQL

In [17]:
%%sql
-- RESET (for reproducibility): drop tables so running top-to-bottom always works on a fresh DB
SET FOREIGN_KEY_CHECKS = 0;

DROP TABLE IF EXISTS temperature_anomalies;
DROP TABLE IF EXISTS crop_production;
DROP TABLE IF EXISTS country_name_mapping;
DROP TABLE IF EXISTS crops;
DROP TABLE IF EXISTS countries;

SET FOREIGN_KEY_CHECKS = 1;

   mysql+pymysql://mfre521d_user:***@127.0.0.1:3306/mfre521d
 * mysql+pymysql://mfre521d_user:***@localhost:3306/mfre521d
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

#### Creating tables needed

In [18]:
%%sql

-- Create countries table (dimensions table)
CREATE TABLE countries (
    country_id INT AUTO_INCREMENT PRIMARY KEY,
    country_name VARCHAR(255) NOT NULL,
    iso3_code CHAR(3) NOT NULL,
    region VARCHAR(100) NOT NULL,
    income_group VARCHAR (100) NOT NULL    
);

   mysql+pymysql://mfre521d_user:***@127.0.0.1:3306/mfre521d
 * mysql+pymysql://mfre521d_user:***@localhost:3306/mfre521d
0 rows affected.

[]

In [19]:
%%sql

-- Create crops table (dimensions table)
CREATE TABLE crops (
    crop_id INT AUTO_INCREMENT PRIMARY KEY,
    crop_name VARCHAR(255) NOT NULL
);

   mysql+pymysql://mfre521d_user:***@127.0.0.1:3306/mfre521d
 * mysql+pymysql://mfre521d_user:***@localhost:3306/mfre521d
0 rows affected.

[]

In [20]:
%%sql

-- Create country_name_mapping table (dimensions table)
CREATE TABLE country_name_mapping (
    source_dataset VARCHAR(50) NOT NULL,
    source_country_name VARCHAR(255) NOT NULL,
    country_id INT NOT NULL,
    PRIMARY KEY (source_dataset, source_country_name),
    FOREIGN KEY (country_id) REFERENCES countries(country_id)
);

   mysql+pymysql://mfre521d_user:***@127.0.0.1:3306/mfre521d
 * mysql+pymysql://mfre521d_user:***@localhost:3306/mfre521d
0 rows affected.

[]

In [21]:
%%sql

-- Create crop_production table (fact table)
CREATE TABLE crop_production (
    country_id INT NOT NULL,
    year INT NOT NULL,
    crop_id INT NOT NULL,

    area_harvested_ha FLOAT,
    production_tonnes FLOAT,
    yield_kg_ha FLOAT,
    fertilizer_use_kg_ha FLOAT,
    irrigation_pct FLOAT,
    notes VARCHAR(255),

    PRIMARY KEY (country_id, year, crop_id),
    FOREIGN KEY (country_id) REFERENCES countries(country_id),
    FOREIGN KEY (crop_id) REFERENCES crops(crop_id)
);

   mysql+pymysql://mfre521d_user:***@127.0.0.1:3306/mfre521d
 * mysql+pymysql://mfre521d_user:***@localhost:3306/mfre521d
0 rows affected.

[]

In [22]:
%%sql

-- Create temperature_anomalies table (fact table)
CREATE TABLE temperature_anomalies (
    country_id INT NOT NULL,
    year INT NOT NULL,

    annual_anomaly_c FLOAT,
    jan FLOAT,
    feb FLOAT, 
    mar FLOAT,
    apr FLOAT,
    may FLOAT,
    jun FLOAT,
    jul FLOAT,
    aug FLOAT,
    sep FLOAT,
    oct FLOAT,
    nov FLOAT,
    `dec` FLOAT,

    PRIMARY KEY (country_id, year),
    FOREIGN KEY (country_id) REFERENCES countries(country_id)
);

   mysql+pymysql://mfre521d_user:***@127.0.0.1:3306/mfre521d
 * mysql+pymysql://mfre521d_user:***@localhost:3306/mfre521d
0 rows affected.

[]

In [23]:
%%sql

SHOW TABLES;

   mysql+pymysql://mfre521d_user:***@127.0.0.1:3306/mfre521d
 * mysql+pymysql://mfre521d_user:***@localhost:3306/mfre521d
15 rows affected.

[('AirQuality_2',),
 ('air_quality_readings',),
 ('countries',),
 ('country_name_mapping',),
 ('crop_production',),
 ('crops',),
 ('daily_summary',),
 ('food_nutrition',),
 ('monthly_summary',),
 ('pollution_thresholds',),
 ('sensor_info',),
 ('temperature_anomalies',),
 ('temperature_readings',),
 ('validated_readings',),
 ('weather_stations',)]

In [24]:
# inspecting data
crop_df.head()

,country,iso3_code,region,income_group,year,crop,area_harvested_ha,production_tonnes,yield_kg_ha,fertilizer_use_kg_ha,irrigation_pct,notes
0,China,CHN,East Asia,Upper middle income,2001,Soybeans,3751494,12036421.75,3208.43,100.9,<NA>,NaN
1,Nepal,NPL,South Asia,Low income,1993,Maize,2112762,11377270.55,5385.02,19.14,9.8,NaN
2,South Korea,KOR,East Asia,High income,1995,Soybeans,1650777,7474101.16,4527.63,193.84,56.6,NaN
3,United States,USA,North America,High income,2018,Wheat,4782989,32397951.41,6773.58,205.12,62.5,NaN
4,Japan,JPN,East Asia,High income,2013,Rice,5434696,58322509.35,10731.51,211.64,61.4,NaN

In [25]:
temp_df.head()

,country_name,year,annual_anomaly_c,jan,feb,mar,apr,may,jun,jul,aug,sep,oct,nov,dec
0,United States of America,1990,0.07,-0.02,<NA>,<NA>,-0.09,-0.11,0.44,-0.44,0.3,-0.08,-0.03,-0.31,-0.39
1,United States of America,1991,0.2,0.36,0.4,0.6,0.74,0.22,0.34,0.22,0.7,<NA>,-0.44,-0.5,-0.22
2,United States of America,1992,0.54,0.46,0.76,0.85,0.68,0.6,0.98,0.52,0.92,0.53,0.01,0.09,0.07
3,United States of America,1993,0.43,0.28,0.22,0.74,0.6,<NA>,1.3,0.81,0.35,-0.3,0.04,0.55,-0.13
4,United States of America,1994,0.87,0.75,0.86,0.65,1.14,0.45,1.71,1.27,1.04,0.01,0.62,1.05,0.88

In [26]:
crop_df.dtypes

country                  object
iso3_code                object
region                   object
income_group             object
year                      Int64
crop                     object
area_harvested_ha         Int64
production_tonnes       Float64
yield_kg_ha             Float64
fertilizer_use_kg_ha    Float64
irrigation_pct          Float64
notes                    object
dtype: object

In [27]:
temp_df.dtypes

country_name         object
year                  int64
annual_anomaly_c    Float64
jan                 Float64
feb                 Float64
mar                 Float64
apr                 Float64
may                 Float64
jun                 Float64
jul                 Float64
aug                 Float64
sep                 Float64
oct                 Float64
nov                 Float64
dec                 Float64
dtype: object

### Building & inserting into countries table

In [28]:
# inserting data into countries table (1 row per iso3 country)

countries_df = crop_df[["country", "iso3_code", "region", "income_group"]].copy()

# removing leading/trailing spaces (to avoid duplicates which occurred without)
for c in ["country", "iso3_code", "region", "income_group"]:
    countries_df[c] = countries_df[c].astype(str).str.strip()

# making sure iso3 is consistent (upper-case)
countries_df["iso3_code"] = countries_df["iso3_code"].str.upper()

# keeping 1 row per iso3_code
countries_df = countries_df.drop_duplicates(subset=["iso3_code"]).rename(
    columns={"country": "country_name"}
)
countries_df.head()

    country_name iso3_code         region         income_group
0          China       CHN      East Asia  Upper middle income
1          Nepal       NPL     South Asia           Low income
2    South Korea       KOR      East Asia          High income
3  United States       USA  North America          High income
4          Japan       JPN      East Asia          High income

In [29]:
# checking duplicates
countries_df.duplicated("iso3_code").sum()

np.int64(0)

In [30]:
# inserting into SQL table
countries_df_to_insert = countries_df.copy()
countries_df_to_insert.to_sql("countries", engine, if_exists="append", index=False)

34

### Building & inserting into crops

In [31]:
# formatting before inserting

crops_df = crop_df[["crop"]].copy()
crops_df["crop"] = crops_df["crop"].astype(str).str.strip()

crops_df = (
    crops_df.drop_duplicates(subset=["crop"])
    .rename(columns={"crop": "crop_name"})
    .sort_values("crop_name")
    .reset_index(drop=True)
)

crops_df.head()

  crop_name
0     Maize
1      Rice
2  Soybeans
3     Wheat

In [32]:
crops_df.to_sql("crops", con=engine, if_exists="append", index=False)

4

In [33]:
# inspecting table
pd.read_sql("SELECT * FROM crops ORDER BY crop_id LIMIT 10;", engine)

   crop_id crop_name
0        1     Maize
1        2      Rice
2        3  Soybeans
3        4     Wheat

### Building & inserting into country_names_mapping

In [34]:
# pulling country table from DB
countries_lookup = pd.read_sql(
    "SELECT country_id, iso3_code, country_name FROM countries;", engine
)

# building mapping tables from each source dataset (unique country identifiers)
mapping_crop = (
    crop_df[["country", "iso3_code"]]
    .drop_duplicates()
    .rename(columns={"country": "source_country_name"})
)
mapping_crop["source_dataset"] = "crop"

mapping_temp = (
    temp_df[["country_name"]]
    .drop_duplicates()
    .rename(columns={"country_name": "source_country_name"})
)
mapping_temp["source_dataset"] = "temp"

# cleaning join keys so merges don't fail due to spaces
countries_lookup["iso3_code"] = (
    countries_lookup["iso3_code"].astype(str).str.strip().str.upper()
)

mapping_crop["iso3_code"] = (
    mapping_crop["iso3_code"].astype(str).str.strip().str.upper()
)
mapping_crop["source_country_name"] = (
    mapping_crop["source_country_name"].astype(str).str.strip()
)

mapping_temp["source_country_name"] = (
    mapping_temp["source_country_name"].astype(str).str.strip()
)
countries_lookup["country_name"] = (
    countries_lookup["country_name"].astype(str).str.strip()
)

# mapping to country_id
# cropping dataset: best key is iso3_code
mapping_crop = mapping_crop.merge(
    countries_lookup[["country_id", "iso3_code"]], on="iso3_code", how="left"
)

# needed because USA, Russia & Vietnam do not match
name_fixes = {
    "United States of America": "United States",
    "Russian Federation": "Russia",
    "Viet Nam": "Vietnam",
}

mapping_temp["source_country_name"] = mapping_temp["source_country_name"].replace(
    name_fixes
)

# temp dataset only has country name, so merge on name
mapping_temp = mapping_temp.merge(
    countries_lookup[["country_id", "country_name"]],
    left_on="source_country_name",
    right_on="country_name",
    how="left",
).drop(columns=["country_name"])

In [35]:
# checks (should be 0)
print("Unmatched crop rows (should be 0):", mapping_crop["country_id"].isna().sum())
print("Unmatched temp rows:", mapping_temp["country_id"].isna().sum())

# if something doesn't match, showing them to fix
if mapping_crop["country_id"].isna().any():
    print("\nUnmatched crop entries:")
    display(
        mapping_crop[mapping_crop["country_id"].isna()][
            ["source_country_name", "iso3_code"]
        ]
    )

if mapping_temp["country_id"].isna().any():
    print("\nUnmatched temp entries:")
    display(mapping_temp[mapping_temp["country_id"].isna()][["source_country_name"]])

# looking at mappings to see what they look like / if they look ok
display(mapping_crop.head())
display(mapping_temp.head())

Unmatched crop rows (should be 0): 0
Unmatched temp rows: 0

  source_country_name iso3_code source_dataset  country_id
0               China       CHN           crop           1
1               Nepal       NPL           crop           2
2         South Korea       KOR           crop           3
3       United States       USA           crop           4
4               Japan       JPN           crop           5

  source_country_name source_dataset  country_id
0       United States           temp           4
1              Canada           temp           6
2           Australia           temp          34
3              France           temp          28
4             Germany           temp          19

In [36]:
# checking if duplicates in countries table are removed

pd.read_sql(
    """
SELECT iso3_code, COUNT(*) AS n
FROM countries
GROUP BY iso3_code
HAVING COUNT(*) > 1;
""",
    engine,
)

dupes = pd.read_sql(
    """
SELECT iso3_code, COUNT(*) AS n
FROM countries
GROUP BY iso3_code
HAVING COUNT(*) > 1;
""",
    engine,
)

print("duplicate iso3 groups:", len(dupes))
dupes

duplicate iso3 groups: 0

Empty DataFrame
Columns: [iso3_code, n]
Index: []

In [37]:
# inserting country_name_mapping into MySQL

mapping_crop_small = mapping_crop[
    ["source_dataset", "source_country_name", "country_id"]
].copy()
mapping_temp_small = mapping_temp[
    ["source_dataset", "source_country_name", "country_id"]
].copy()

country_name_mapping_df = pd.concat(
    [mapping_crop_small, mapping_temp_small], ignore_index=True
).drop_duplicates(subset=["source_dataset", "source_country_name"])

country_name_mapping_df.to_sql(
    "country_name_mapping", con=engine, if_exists="append", index=False
)

76

In [38]:
# checking how many entries from crop dataset & temp dataset

pd.read_sql(
    "SELECT source_dataset, COUNT(*) AS n FROM country_name_mapping GROUP BY source_dataset;",
    engine,
)

  source_dataset   n
0           crop  42
1           temp  34

In [39]:
# checking no NULL country_id rows inserted

pd.read_sql(
    """
SELECT source_dataset, COUNT(*) AS null_ids
FROM country_name_mapping
WHERE country_id IS NULL
GROUP BY source_dataset;
""",
    engine,
)

Empty DataFrame
Columns: [source_dataset, null_ids]
Index: []

In [40]:
%%sql
DESCRIBE crop_production;

   mysql+pymysql://mfre521d_user:***@127.0.0.1:3306/mfre521d
 * mysql+pymysql://mfre521d_user:***@localhost:3306/mfre521d
9 rows affected.

[('country_id', 'int', 'NO', 'PRI', None, ''),
 ('year', 'int', 'NO', 'PRI', None, ''),
 ('crop_id', 'int', 'NO', 'PRI', None, ''),
 ('area_harvested_ha', 'float', 'YES', '', None, ''),
 ('production_tonnes', 'float', 'YES', '', None, ''),
 ('yield_kg_ha', 'float', 'YES', '', None, ''),
 ('fertilizer_use_kg_ha', 'float', 'YES', '', None, ''),
 ('irrigation_pct', 'float', 'YES', '', None, ''),
 ('notes', 'varchar(255)', 'YES', '', None, '')]

### Building & Inserting into crop_production

In [41]:
# Need to attach IDs before inserting
# countries_key tells us iso3_code mapping to country_id & crops_key maps crop_name to crop_id
countries_key = pd.read_sql("SELECT country_id, iso3_code FROM countries;", engine)
crops_key = pd.read_sql("SELECT crop_id, crop_name FROM crops;", engine)

crop_fact = crop_df.copy()

# cleaning the join keys so merges match (& we're sure of it) e.g., 'usa', 'USA' & 'USA ' will match
crop_fact["iso3_code"] = crop_fact["iso3_code"].astype(str).str.strip().str.upper()
crop_fact["crop"] = crop_fact["crop"].astype(str).str.strip()

# merging in country_id using iso3_codes
crop_fact = crop_fact.merge(countries_key, on="iso3_code", how="left")

# merging in crop_id using crop_name
crop_fact = crop_fact.merge(crops_key, left_on="crop", right_on="crop_name", how="left")

# keeping only columns expected by SQL table
crop_fact = crop_fact[
    [
        "country_id",
        "year",
        "crop_id",
        "area_harvested_ha",
        "production_tonnes",
        "yield_kg_ha",
        "fertilizer_use_kg_ha",
        "irrigation_pct",
        "notes",
    ]
].copy()

crop_fact.columns

Index(['country_id', 'year', 'crop_id', 'area_harvested_ha',
       'production_tonnes', 'yield_kg_ha', 'fertilizer_use_kg_ha',
       'irrigation_pct', 'notes'],
      dtype='object')

In [42]:
# checking data

crop_fact.dtypes

print("missing country_id:", crop_fact["country_id"].isna().sum())
print("missing crop_id:", crop_fact["crop_id"].isna().sum())

missing country_id: 0
missing crop_id: 0

In [43]:
# inserting into crop_production

crop_fact.to_sql(
    "crop_production",
    con=engine,
    if_exists="append",
    index=False,
    method="multi",
    chunksize=1000,
)

4187

### Building & Inserting into temperature_anomalies

In [44]:
# checking country_id & country_name in countries for US, Russia, Vietnam = problematic countries

pd.read_sql(
    """
SELECT country_id, country_name
FROM countries
WHERE country_name IN ('United States', 'Russia', 'Vietnam');
""",
    engine,
)

   country_id   country_name
0           4  United States
1           8        Vietnam
2          12         Russia

In [45]:
# adding the 3 missing temp name mappings

fixes = pd.DataFrame(
    {
        "source_dataset": ["temp", "temp", "temp"],
        "source_country_name": [
            "United States of America",
            "Russian Federation",
            "Viet Nam",
        ],
        "country_id": [4, 12, 8],
    }
)

fixes.to_sql("country_name_mapping", con=engine, if_exists="append", index=False)

3

In [46]:
# checking names & country_ids of problematic countries in country_name_mapping

pd.read_sql(
    """
SELECT source_country_name, country_id
FROM country_name_mapping
WHERE source_dataset='temp'
AND source_country_name IN ('United States of America','Russian Federation','Viet Nam');
""",
    engine,
)

        source_country_name  country_id
0        Russian Federation          12
1  United States of America           4
2                  Viet Nam           8

In [47]:
# getting country_id from country_name_mapping

temp_map = pd.read_sql(
    """
SELECT source_country_name, country_id
FROM country_name_mapping
WHERE source_dataset = 'temp';
""",
    engine,
)

month_cols = [
    "jan",
    "feb",
    "mar",
    "apr",
    "may",
    "jun",
    "jul",
    "aug",
    "sep",
    "oct",
    "nov",
    "dec",
]

# joining first (keeping country_name & source_country_name because bugs occurred)
temp_joined = temp_df.assign(
    source_country_name=temp_df["country_name"].astype(str).str.strip()
).merge(temp_map, on="source_country_name", how="left")

# seeing which country names didn't map (bug previously)
unmatched = temp_joined.loc[
    temp_joined["country_id"].isna(), ["country_name", "source_country_name"]
].drop_duplicates()
display(unmatched)

# makes sure that the code stops is anything is unmatched
assert (
    unmatched.empty
), "Some temp country names did not map to country_id. Fix mapping before inserting."

# subsetting to the exact columns that match the SQL table
temp_fact = temp_joined[["country_id", "year", "annual_anomaly_c"] + month_cols].copy()

Empty DataFrame
Columns: [country_name, source_country_name]
Index: []

In [48]:
# inserting data into SQL table
temp_fact.to_sql("temperature_anomalies", con=engine, if_exists="append", index=False)

1137

### Final checks

In [49]:
# final checks - number of rows

pd.read_sql(
    """
SELECT 'countries' AS t, COUNT(*) n FROM countries
UNION ALL SELECT 'crops', COUNT(*) FROM crops
UNION ALL SELECT 'country_name_mapping', COUNT(*) FROM country_name_mapping
UNION ALL SELECT 'crop_production', COUNT(*) FROM crop_production
UNION ALL SELECT 'temperature_anomalies', COUNT(*) FROM temperature_anomalies;
""",
    engine,
)

                       t     n
0              countries    34
1                  crops     4
2   country_name_mapping    79
3        crop_production  4187
4  temperature_anomalies  1137

In [50]:
# final check - duplicates

pd.read_sql(
    """
SELECT COUNT(*) AS dupes
FROM (
  SELECT country_id, year, crop_id, COUNT(*) c
  FROM crop_production
  GROUP BY 1,2,3
  HAVING COUNT(*) > 1
) x;
""",
    engine,
)

pd.read_sql(
    """
SELECT COUNT(*) AS dupes
FROM (
  SELECT country_id, year, COUNT(*) c
  FROM temperature_anomalies
  GROUP BY 1,2
  HAVING COUNT(*) > 1
) x;
""",
    engine,
)

   dupes
0      0